data/distributed_erlang.org
#+OPTIONS: ^:{}
* Распределенность в Erlang

30 марта 2014

Вчера выступил для [[http://www.meetup.com/fsharpminsk/events/167278002/][Minsk F# User Group]], с рассказом про
распределенность в Erlang. Народу собралось не много, но зато те, кто
собрались, почти все выдержали до конца выступления. Значит было
интересно :) А получилось довольно длинно -- где-то 2 часа рассказывал
теорию, и 1 час live coding.

Помещение любезно предоставлено [[https://www.facebook.com/mdubakov/posts/10152292589669826?stream_ref=10][лучшей в Беларуси]] IT-компанией
[[http://taucraft.com/][Taucraft]]. Мне было интересно посмотреть их офис, и я просил
[[http://www.meetup.com/fsharpminsk/members/73009372/][организаторов]], чтобы встреча была именно там. Посмотрел. Офис очень
клевый. Я бы там с удовольствием работал. Жаль, по стеку технологий я
совсем не подхожу :)

Презентация [[http://www.slideshare.net/YuriZhloba/distributed-erlang-32886201][тут]]. Текст выступления ниже. Код live coding [[https://github.com/yzh44yzh/erlang-school/tree/master/distributed_chat][тут]].


** Что такое распределенная система?

[[http://en.wikipedia.org/wiki/Leslie_Lamport][Лесли Лэмпорт]] (ученый, исследователь теории распределенных систем):

    A distributed system is one in which the failure of a computer you
    didn’t even know existed can render your own computer unusable.

Ну это, конечно, шутка. А если серьезно, то распределенную систему можно определить так:
система, состоящая из 2-х и более компьютеров, взаимодействующих между собой.

Систем таких много, самых разных. И примеры долго искать не нужно:

Хранилища данных: Google BigTable, Amazon SimpleDB, Hadoop, Cassandra,
множество их, в т.ч. и написаные на Erlang: Riak, CouchDB.

Сервисы: Google Search, поиск Яндекса, WhatsApp, множество их, в
т.ч. и написаные частично на Erlang: Heroku, Github.

Социальные сети: Facebook, Twitter, Вконтакте и др.

Многопользовательские игры: Word of Warcraft, Call of Duty Black Ops и др.


** Зачем их делают?

Не то, чтобы все прям горели желанием, но приходится это делать тогда,
когда задача не решается на одной машине:

- Хранить данных больше, чем может поместиться на одной машине;
- Обрабатывать данных больше, чем можно обработать на одной машине;
- Повысить надежность системы;
- Построить масштабируемую систему, способную адаптироваться к росту нагрузки;
- Сервисы, распределенные по своей сути (например, CDN -- content delivery network);


** Какова надежность Erlang?

Erlang изначально ставил своей целью повысить надежность
системы. Распределенность -- один из его уровней отказоустойчивости. И
по части надежности и отказоустойчивости инженерам Ericsson удалось
добиться весьма впечатляющих результатов.

Отказоустойчивость систем принято оценивать, как соотношение времени,
когда система была доступна пользователям, ко времени, когда была
недоступна. Промежуток времени берется -- год, а соотношение оценивают в %.


| Availability % | Downtime per year |
|----------------+-------------------|
| 90% (one nine) | < month           |
| 99%            | < 4 days          |
| 99,9%          | < 9 hours         |
| 99,99%         | < 1 hour          |
| 99,999%        | ~ 5 min           |
| 99,9999%       | ~ 31 sec          |
| 99,99999%      | ~ 3 sec           |
| 99,999999%     | ~ 300 msec        |
| 99,9999999%    | ~ 30 msec         |

С помощью Erlang была построена система с надежностью Nine Nines (девять девяток)

Вот [[http://pragprog.com/articles/erlang][тут]] один из создателей языка Джо Армстронг хвастается:

    The AXD301 has achieved a NINE nines reliability (yes, you read that
    right, 99.9999999%). Let’s put this in context: 5 nines is reckoned to
    be good (5.2 minutes of downtime/year). 7 nines almost unachievable
    ... but we did 9.

А компания [[http://ninenines.eu/][99s]], давшая нам такие прекрасные тулы, как Cowboy, Ranch и Bullet,
названа именно в честь такой отказоустойчивости Erlang.


** Терминология

Введем немного терминологии.

Эрланг приложение (Application) -- система, сервис или библиотека с
определенной функцией.  Например: веб-сервер Cowboy, сервис
логирования Lager, драйвер к базе данных и т.д.

Узел (Node) -- экземпляр виртуальной машины Erlang. Обычно выполняет
несколько Эрланг приложений.  На одной машине может быть запущено
несколько узлов.

Кластер -- несколько узлов, взаимодействующих между собой.
Узлов в кластере может быть от 2х до сотен и тысяч :)


