post/distributed_erlang.html
<html>
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>Distributed Erlang</title>
    <link rel="stylesheet" type="text/css" href="/css/bootstrap.min.css" />
    <link rel="stylesheet" type="text/css" href="/css/main.css" />
  </head>
<body>

  <div id="header">
    <div id="main_title">
      <a href="/" style="color:#013;">Про Erlang и про всякое</a>
    </div>
    <div id="profile_link">
      <a href="https://plus.google.com/u/0/+YuriZhloba/about" style="color:#013;">Юра Жлоба</a>
    </div>
  </div>

<div id="content">
<h1>Distributed Erlang</h1>
<p><i>30 марта 2014</i></p>

<p>
Вчера выступил для <a href="http://www.meetup.com/fsharpminsk/events/167278002/">Minsk F# User Group</a>, с рассказом про
распределенность в Erlang. Народу собралось не много, но зато те, кто
собрались, почти все выдержали до конца выступления. Значит было
интересно :) А получилось довольно длинно &#x2013; где-то 2 часа рассказывал
теорию, и 1 час live coding.
</p>

<p>
Помещение любезно предоставлено <a href="https://www.facebook.com/mdubakov/posts/10152292589669826?stream_ref=10">лучшей в Беларуси</a> IT-компанией
<a href="http://taucraft.com/">Taucraft</a>. Мне было интересно посмотреть их офис, и я просил
<a href="http://www.meetup.com/fsharpminsk/members/73009372/">организаторов</a>, чтобы встреча была именно там. Посмотрел. Офис очень
клевый. Я бы там с удовольствием работал. Жаль, по стеку технологий я
совсем не подхожу :)
</p>

<p>
Презентация <a href="http://www.slideshare.net/YuriZhloba/distributed-erlang-32886201">тут</a>. Текст выступления ниже. Код live coding <a href="https://github.com/yzh44yzh/erlang-school/tree/master/distributed_chat">тут</a>.
</p>

<ul>
<li><a href="#sec-1">1. Распределенность в Erlang</a>
<ul>
<li><a href="#sec-1-1">1.1. Что такое распределенная система?</a></li>
<li><a href="#sec-1-2">1.2. Зачем их делают?</a></li>
<li><a href="#sec-1-3">1.3. Какова надежность Erlang?</a></li>
<li><a href="#sec-1-4">1.4. Терминология</a></li>
<li><a href="#sec-1-5">1.5. Что такого особенного в Erlang?</a></li>
<li><a href="#sec-1-6">1.6. Ссылки</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Erlang кластер</a>
<ul>
<li><a href="#sec-2-1">2.1. Имена узлов</a></li>
<li><a href="#sec-2-2">2.2. Соединение</a></li>
<li><a href="#sec-2-3">2.3. Куки</a></li>
<li><a href="#sec-2-4">2.4. epmd</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Модули и функции</a></li>
<li><a href="#sec-4">4. Распределенное OTP приложение</a></li>
<li><a href="#sec-5">5. Net Split</a></li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Распределенность в Erlang</h2>
<div class="outline-text-2" id="text-1">

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Что такое распределенная система?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="http://en.wikipedia.org/wiki/Leslie_Lamport">Лесли Лэмпорт</a> (ученый, исследователь теории распределенных систем):
</p>

<p>
A distributed system is one in which the failure of a computer you
didn’t even know existed can render your own computer unusable.
</p>

<p>
Ну это, конечно, шутка. А если серьезно, то распределенную систему можно определить так:
система, состоящая из 2-х и более компьютеров, взаимодействующих между собой.
</p>

<p>
Систем таких много, самых разных. И примеры долго искать не нужно:
</p>

<p>
Хранилища данных: Google BigTable, Amazon SimpleDB, Hadoop, Cassandra,
множество их, в т.ч. и написаные на Erlang: Riak, CouchDB.
</p>

<p>
Сервисы: Google Search, поиск Яндекса, WhatsApp, множество их, в
т.ч. и написаные частично на Erlang: Heroku, Github.
</p>

<p>
Социальные сети: Facebook, Twitter, Вконтакте и др.
</p>

<p>
Многопользовательские игры: Word of Warcraft, World of Tanks, Call of
Duty Black Ops и др.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Зачем их делают?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Не то, чтобы все прям горели желанием, но приходится это делать тогда,
когда задача не решается на одной машине:
</p>

<ul class="org-ul">
<li>Хранить данных больше, чем может поместиться на одной машине;
</li>
<li>Обрабатывать данных больше, чем можно обработать на одной машине;
</li>
<li>Повысить надежность системы;
</li>
<li>Построить масштабируемую систему, способную адаптироваться к росту нагрузки;
</li>
<li>Сервисы, распределенные по своей сути (например, CDN &#x2013; content delivery network);
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Какова надежность Erlang?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Erlang изначально ставил своей целью повысить надежность
системы. Распределенность &#x2013; один из его уровней отказоустойчивости. И
по части надежности и отказоустойчивости инженерам Ericsson удалось
добиться весьма впечатляющих результатов.
</p>

<p>
Отказоустойчивость систем принято оценивать, как соотношение времени,
когда система была доступна пользователям, ко времени, когда была
недоступна. Промежуток времени берется &#x2013; год, а соотношение оценивают в %.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Availability %</th>
<th scope="col" class="left">Downtime per year</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">90% (one nine)</td>
<td class="left">&lt; month</td>
</tr>

<tr>
<td class="left">99%</td>
<td class="left">&lt; 4 days</td>
</tr>

<tr>
<td class="left">99,9%</td>
<td class="left">&lt; 9 hours</td>
</tr>

<tr>
<td class="left">99,99%</td>
<td class="left">&lt; 1 hour</td>
</tr>

<tr>
<td class="left">99,999%</td>
<td class="left">~ 5 min</td>
</tr>

<tr>
<td class="left">99,9999%</td>
<td class="left">~ 31 sec</td>
</tr>

<tr>
<td class="left">99,99999%</td>
<td class="left">~ 3 sec</td>
</tr>

<tr>
<td class="left">99,999999%</td>
<td class="left">~ 300 msec</td>
</tr>

<tr>
<td class="left">99,9999999%</td>
<td class="left">~ 30 msec</td>
</tr>
</tbody>
</table>

<p>
С помощью Erlang была построена система с надежностью Nine Nines (девять девяток)
</p>

<p>
Вот <a href="http://pragprog.com/articles/erlang">тут</a> один из создателей языка Джо Армстронг хвастается:
</p>

<p>
The AXD301 has achieved a NINE nines reliability (yes, you read that
right, 99.9999999%). Let’s put this in context: 5 nines is reckoned to
be good (5.2 minutes of downtime/year). 7 nines almost unachievable
&#x2026; but we did 9.
</p>

<p>
А компания <a href="http://ninenines.eu/">99s</a>, давшая нам такие прекрасные тулы, как Cowboy, Ranch и Bullet,
названа именно в честь такой отказоустойчивости Erlang.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Терминология</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Введем немного терминологии.
</p>

<p>
Эрланг приложение (Application) &#x2013; система, сервис или библиотека с
определенной функцией.  Например: веб-сервер Cowboy, сервис
логирования Lager, драйвер к базе данных и т.д.
</p>

<p>
Узел (Node) &#x2013; экземпляр виртуальной машины Erlang. Обычно выполняет
несколько Эрланг приложений.  На одной машине может быть запущено
несколько узлов.
</p>

<p>
Кластер &#x2013; несколько узлов, взаимодействующих между собой.
Узлов в кластере может быть от 2х до сотен и тысяч :)
</p>
</div>
</div>
