data/distributed_erlang.org
** Что такого особенного в Erlang?

Эффективную распределенную систему можно построить на самых разных
технологиях и ЯП.  А в чем особенность именно Erlang? Он предлагает
единый подход и к локальному и к распределенному программированию.

Архитектура Erlang-приложения строится из независимых процессов,
общающихся между собой отправкой сообщений.

Как элемент архитектуры, процесс:
- имеет публичный АПИ (реагирует на определенные сообщения);
- хранит внутри себя состояние (некие данные);
- общается с другими процессами, пользуясь их публичным АПИ;
- имеет закрытую бизнес-логику;

На что это похоже? На объект в ООП.

Идем уровнем выше. Из процессов строятся приложения.

Приложение:
- имеет публичный АПИ;
- хранит внутри себя данные;
- общается с другими приложениями, пользуясь их публичным АПИ;
- имеет закрытую бизнес-логику;

Идем уровнем выше. Для выполнения приложений запускается узел.

Узел:
- имеет публичный АПИ;
- хранит внутри себя данные;
- общается с клиентами и другими узлами;
- имеет закрытую бизнес-логику;

Идем уровне выше. Из узлов строится кластер.

Кластер:
- имеет публичный АПИ;
- хранит внутри себя данные;
- общается с клиентами;
- имеет закрытую бизнес-логику;

На всех уровнях у нас один и тот же архитектурный паттерн. Но это еще
не особенность Erlang, так можно строить систему и на других языках.

Вся фишка Erlang в сетевой прозрачности. Процессы общаются отправкой
сообщений друг другу, при этом не важно, находятся ли они на одном
узле, или на разных. За реализацию отвечает виртуальная машина. Она
сама открывает сокеты, устанавливает нужные TCP соединения между
узлами, мониторит их состояние -- программисту об этих низкоуровневых
вещах думать не нужно.

Пробуем:
#+BEGIN_SRC Shell-script
erl -name node1@127.0.0.1

erl -name node2@127.0.0.1

(node1@127.0.0.1)1> net_adm:ping('node2@127.0.0.1').
pong
(node1@127.0.0.1)2> register(my_shell, self()).
true

(node2@127.0.0.1)1> {my_shell, 'node1@127.0.0.1'} ! "hello there".
"hello there"

(node1@127.0.0.1)3> flush().
Shell got "hello there"
ok
(node1@127.0.0.1)4> node().
'node1@127.0.0.1'
(node1@127.0.0.1)5> nodes().
['node2@127.0.0.1']
#+END_SRC

Это база всех взаимодействий. Если я знаю Pid процесса, или знаю, под
каким именем он зарегистрирован, то я могу с ним общаться. Pid
уникален в пределах кластера. Имя уникально в пределах узла.

На самом деле вот такой код, с отправкой сообщений, пишут редко. На
базе сообщений построены более высокие и удобные уровни: gen_server,
rpc:call, распределенное OTP приложение и т.д. И разработчики обычно
пользуются ими.

Но сетевая прозрачность касается не только отправки сообщений, но и
мониторинга процессов. Мониторинг, это когда один процесс (supervisor)
наблюдает за состоянием другого процесса (worker), и получает сообщение
если с worker случается какая-то проблема. Supervisor может
предпринять в этом случае какие-то действия. Например, перезапустить
worker.

Эти механизмы тоже действуют в условиях сетевой прозрачности. Мониторить
можно не только процессы в своем узле, но и процессы в другом узле.
И можно мониторить доступность другого узла, и предпринять какие-то
действия, если связь с другим узлом потеряна. Например, запустить
резервную систему.


** Ссылки

Весьма рекомендую книгу Фреда Хеберта
[[http://learnyousomeerlang.com/content][Learn you some Erlang for greate good!]]

Она изначально была опубликована на сайте
[[http://www.amazon.com/Learn-Some-Erlang-Great-Good/dp/1593274351/][недавно вышла и в бумажном виде, и в электронном]]

2 главы там посвящены распределенным приложениям:
[[http://learnyousomeerlang.com/distribunomicon][Distribunomicon]]
[[http://learnyousomeerlang.com/distributed-otp-applications][Distributed OTP Applications]]

Соответствующие главы по теме есть и в классических книгах:
[[http://www.amazon.com/Programming-Erlang-Concurrent-Pragmatic-Programmers/dp/193778553X/][Programming Erlang: Software for a Concurrent World. Joe Armstrong]]
[[http://www.amazon.com/Erlang-Programming-Francesco-Cesarini/dp/0596518188/][Erlang Programming. Francesco Cesarini, Simon Thompson]]

И в менее известной, но тоже очень хорошей
[[http://www.amazon.com/Erlang-OTP-Action-Martin-Logan/dp/1933988789/][Erlang and OTP in Action. Martin Logan, Eric Merritt]]


* Erlang кластер

Erlang-узлы, собранные в кластер, формируют доверенную среду (trusted
environment), без ограничения прав. Любой процесс может посылать любые
сообщения кому угодно.  Это удобно, не безопасно. Подразумевается, что
все узлы находятся в одной локальной сети, и сеть защищена от внешнего
мира фаерволами и т.д.

Если мы хотим наладить взаимодействие между узлами в разных сетях, то лучше
делать независимые веб-сервисы, предоставляющие защищенное АПИ внешнему миру
(например, REST HTTP API), как вы бы это делали на других языках.
То есть, отказаться от эрланговской сетевой прозрачности.

Есть еще вариант -- кастомизировать те средства, на которых построено общение
между Erlang-узлами, пустив траффик по ssl и добавив какие-то еще меры защиты.
Но я бы лучше сразу предполагал, что система будет разнородна, с участием
не только Erlang, но и других технологий. И строил бы REST API.


** Имена узлов

При запуске узла ему дается имя

#+BEGIN_SRC Shell-script
erl -name node@host
#+END_SRC

Имена бывают короткие и длинные, но написано про это во всех
источниках как-то мутно, и я так и не понял, зачем нужны короткие
имена. Использую длинные, они всегда работают :)

В длинных именах имя хоста должно определяться DNS или это может быть IP адрес.
Я предпочитаю IP адрес, чтобы не возиться с настройкой и поддержкой DNS :)


** Соединение

Соединение устанавливается автоматически если один узел обращается к другому:
отправляет сообщение зарегистрированному процессу, net_adm:ping и др.

По умолчанию каждый узел в кластере связывается со всеми остальными.

- 4 узла -- 6 соединений;
- 10 узлов -- 45 соединений;
- и дальше рост в арифметической прогрессии :)

Соединения не бесплатны, конечно. По ним ходят служебные сообщения Heart Beat,
поддерживающие связь. В большом кластере такой трафик может быть существенным.

Но есть альтернатива -- скрытые узлы.

#+BEGIN_SRC Shell-script
erl -name foo@host -hidden
#+END_SRC

Такой узел соединяется только с теми узлами, с которыми его явно соединили.
Используя эти узлы можно строить подходящую топологию кластера.


