post/distributed_erlang.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Что такого особенного в Erlang?</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Эффективную распределенную систему можно построить на самых разных
технологиях и ЯП.  А в чем особенность именно Erlang? Он предлагает
единый подход и к локальному и к распределенному программированию.
</p>

<p>
Архитектура Erlang-приложения строится из независимых процессов,
общающихся между собой отправкой сообщений.
</p>

<p>
Как элемент архитектуры, процесс:
</p>
<ul class="org-ul">
<li>имеет публичный АПИ (реагирует на определенные сообщения);
</li>
<li>хранит внутри себя состояние (некие данные);
</li>
<li>общается с другими процессами, пользуясь их публичным АПИ;
</li>
<li>имеет закрытую бизнес-логику;
</li>
</ul>

<p>
На что это похоже? На объект в ООП.
</p>

<p>
Идем уровнем выше. Из процессов строятся приложения.
</p>

<p>
Приложение:
</p>
<ul class="org-ul">
<li>имеет публичный АПИ;
</li>
<li>хранит внутри себя данные;
</li>
<li>общается с другими приложениями, пользуясь их публичным АПИ;
</li>
<li>имеет закрытую бизнес-логику;
</li>
</ul>

<p>
Идем уровнем выше. Для выполнения приложений запускается узел.
</p>

<p>
Узел:
</p>
<ul class="org-ul">
<li>имеет публичный АПИ;
</li>
<li>хранит внутри себя данные;
</li>
<li>общается с клиентами и другими узлами;
</li>
<li>имеет закрытую бизнес-логику;
</li>
</ul>

<p>
Идем уровне выше. Из узлов строится кластер.
</p>

<p>
Кластер:
</p>
<ul class="org-ul">
<li>имеет публичный АПИ;
</li>
<li>хранит внутри себя данные;
</li>
<li>общается с клиентами;
</li>
<li>имеет закрытую бизнес-логику;
</li>
</ul>

<p>
На всех уровнях у нас один и тот же архитектурный паттерн. Но это еще
не особенность Erlang, так можно строить систему и на других языках.
</p>

<p>
Вся фишка Erlang в сетевой прозрачности. Процессы общаются отправкой
сообщений друг другу, при этом не важно, находятся ли они на одном
узле, или на разных. За реализацию отвечает виртуальная машина. Она
сама открывает сокеты, устанавливает нужные TCP соединения между
узлами, мониторит их состояние &#x2013; программисту об этих низкоуровневых
вещах думать не нужно.
</p>

<p>
Пробуем:
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">erl -name node1@127.0.0.1

erl -name node2@127.0.0.1

(node1@127.0.0.1)1&gt; net_adm:ping('node2@127.0.0.1').
pong
(node1@127.0.0.1)2&gt; register(my_shell, self()).
true

(node2@127.0.0.1)1&gt; {my_shell, 'node1@127.0.0.1'} ! "hello there".
"hello there"

(node1@127.0.0.1)3&gt; flush().
Shell got "hello there"
ok
(node1@127.0.0.1)4&gt; node().
'node1@127.0.0.1'
(node1@127.0.0.1)5&gt; nodes().
['node2@127.0.0.1']
</pre>
</div>

<p>
Это база всех взаимодействий. Если я знаю Pid процесса, или знаю, под
каким именем он зарегистрирован, то я могу с ним общаться. Pid
уникален в пределах кластера. Имя уникально в пределах узла.
</p>

<p>
На самом деле вот такой код, с отправкой сообщений, пишут редко. На
базе сообщений построены более высокие и удобные уровни: gen_server,
rpc:call, распределенное OTP приложение и т.д. И разработчики обычно
пользуются ими.
</p>

<p>
Но сетевая прозрачность касается не только отправки сообщений, но и
мониторинга процессов. Мониторинг, это когда один процесс (supervisor)
наблюдает за состоянием другого процесса (worker), и получает сообщение
если с worker случается какая-то проблема. Supervisor может
предпринять в этом случае какие-то действия. Например, перезапустить
worker.
</p>

<p>
Эти механизмы тоже действуют в условиях сетевой прозрачности. Мониторить
можно не только процессы в своем узле, но и процессы в другом узле.
И можно мониторить доступность другого узла, и предпринять какие-то
действия, если связь с другим узлом потеряна. Например, запустить
резервную систему.
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Ссылки</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Весьма рекомендую книгу Фреда Хеберта
<a href="http://learnyousomeerlang.com/content">Learn you some Erlang for greate good!</a>
</p>

<p>
Она изначально была опубликована на сайте
<a href="http://www.amazon.com/Learn-Some-Erlang-Great-Good/dp/1593274351/">недавно вышла и в бумажном виде, и в электронном</a>
</p>

<p>
2 главы там посвящены распределенным приложениям:
<a href="http://learnyousomeerlang.com/distribunomicon">Distribunomicon</a>
<a href="http://learnyousomeerlang.com/distributed-otp-applications">Distributed OTP Applications</a>
</p>

<p>
Соответствующие главы по теме есть и в классических книгах:
<a href="http://www.amazon.com/Programming-Erlang-Concurrent-Pragmatic-Programmers/dp/193778553X/">Programming Erlang: Software for a Concurrent World. Joe Armstrong</a>
<a href="http://www.amazon.com/Erlang-Programming-Francesco-Cesarini/dp/0596518188/">Erlang Programming. Francesco Cesarini, Simon Thompson</a>
</p>

<p>
И в менее известной, но тоже очень хорошей
<a href="http://www.amazon.com/Erlang-OTP-Action-Martin-Logan/dp/1933988789/">Erlang and OTP in Action. Martin Logan, Eric Merritt</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Erlang кластер</h2>
<div class="outline-text-2" id="text-2">
<p>
Erlang-узлы, собранные в кластер, формируют доверенную среду (trusted
environment), без ограничения прав. Любой процесс может посылать любые
сообщения кому угодно.  Это удобно, не безопасно. Подразумевается, что
все узлы находятся в одной локальной сети, и сеть защищена от внешнего
мира фаерволами и т.д.
</p>

<p>
Если мы хотим наладить взаимодействие между узлами в разных сетях, то лучше
делать независимые веб-сервисы, предоставляющие защищенное АПИ внешнему миру
(например, REST HTTP API), как вы бы это делали на других языках.
То есть, отказаться от эрланговской сетевой прозрачности.
</p>

<p>
Есть еще вариант &#x2013; кастомизировать те средства, на которых построено общение
между Erlang-узлами, пустив траффик по ssl и добавив какие-то еще меры защиты.
Но я бы лучше сразу предполагал, что система будет разнородна, с участием
не только Erlang, но и других технологий. И строил бы REST API.
</p>
</div>


<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Имена узлов</h3>
<div class="outline-text-3" id="text-2-1">
<p>
При запуске узла ему дается имя
</p>

<div class="org-src-container">

<pre class="src src-Shell-script">erl -name node@host
</pre>
</div>

<p>
Имена бывают короткие и длинные, но написано про это во всех
источниках как-то мутно, и я так и не понял, зачем нужны короткие
имена. Использую длинные, они всегда работают :)
</p>

<p>
В длинных именах имя хоста должно определяться DNS или это может быть IP адрес.
Я предпочитаю IP адрес, чтобы не возиться с настройкой и поддержкой DNS :)
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Соединение</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Соединение устанавливается автоматически если один узел обращается к другому:
отправляет сообщение зарегистрированному процессу, net_adm:ping и др.
</p>

<p>
По умолчанию каждый узел в кластере связывается со всеми остальными.
</p>

<ul class="org-ul">
<li>4 узла &#x2013; 6 соединений;
</li>
<li>10 узлов &#x2013; 45 соединений;
</li>
<li>и дальше рост в арифметической прогрессии :)
</li>
</ul>

<p>
Соединения не бесплатны, конечно. По ним ходят служебные сообщения Heart Beat,
поддерживающие связь. В большом кластере такой трафик может быть существенным.
</p>

<p>
Но есть альтернатива &#x2013; скрытые узлы.
</p>

<div class="org-src-container">

<pre class="src src-Shell-script">erl -name foo@host -hidden
</pre>
</div>

<p>
Такой узел соединяется только с теми узлами, с которыми его явно соединили.
Используя эти узлы можно строить подходящую топологию кластера.
</p>
</div>
</div>
