data/distributed_erlang.org
** Куки

Некоторый уровень безопасности в кластере все-таки есть. Все Erlang узлы на старте
получают куку -- специальную строку символов, типа как пароль, только без логина
(или, наоборот, логин без пароля).

Когда узел пытается соединится с другим, он посылает свою куку (в зашифрованном виде).
Другой узел сравнивает со своей кукой, и отклоняет соединение, если куки не совпали.

Задать куку можно 3-мя способами:

положить в файл
#+BEGIN_SRC Shell-script
~/.erlang.cookie
#+END_SRC
(и поставить на него права 400, иначе узел не запустится)

задать в аргументах при запуске узла
#+BEGIN_SRC Shell-script
erl -setcookie abc
#+END_SRC

выполнить
#+BEGIN_SRC Erlang
erlang:set_cookie(Node, Cookie)
#+END_SRC
в уже запущеном узле.

Но если я знаю куку от чужого кластера, я могу запустить свой узел,
подключить его к чужому кластеру, и выполнить:

#+BEGIN_SRC Erlang
rpc:multicall(nodes(), os, cmd, ["rm -rf /"]).
#+END_SRC

** epmd
[[http://www.erlang.org/doc/man/epmd.html][Erlang Port Mapper Daemon]]

Специальный сервис, который стартует вместе с первым Erlang узлом.
У него можно узнать, какие узлы запущены на данной машине, и какие
порты нужно использовать, чтобы соединиться с ними.

Его можно запускать вручную с разными настройками:
- задать не стандартный порт (стандартный для него 4369);
- время heart beat сообщений;
- настройки, позволяющие эмулировать загруженность сети.


* Модули и функции

Небольшой обзор модулей и функций, которые используются в
распределенном программировании.


*Global* [[http://www.erlang.org/doc/man/global.html][A Global Name Registration Facility]]

Регистрация имен процессов в глобальной (для всего кластера) области видимости.
#+BEGIN_SRC Erlang
global:register_name(Name, Pid)
global:re_register_name(Name, Pid)
global:whereis_name(Name)
#+END_SRC

При такой регистрации возможен конфликт имен. Модуль также предлагает
средства для разрешения этого конфликта.


*net_adm* [[http://www.erlang.org/doc/man/net_adm.html][Various Erlang Net Administration Routines]]

Тут есть популярная функция:
#+BEGIN_SRC Erlang
net_adm:ping(node)
#+END_SRC


*erlang* [[http://www.erlang.org/doc/man/erlang.html][The Erlang BIFs]]

Среди можножества Erlang BIFs есть:

- node() -- узнать имя своего узла;
- nodes() -- получить список узлов, с которым соединен данный узел;
- monitor_node(Node, Flag) -- включить/выключить мониторинг состояния узла;
- disconnect_node(Node) -- отсоединиться от узла;
- и другие.

Все функции для запуска процесса имеют варианты запуска на другом узле

- spawn(Fun);
- spawn(Node, Fun);
- spawn(Module, Function, Args);
- spawn(Node, Module, Function, Args);
- spawn_link(Fun);
- spawn_link(Node, Fun);
- spawn_link(Module, Function, Args);
- spawn_link(Node, Module, Function, Args).


*net_kernel*
[[http://www.erlang.org/doc/man/net_kernel.html][Erlang Networking Kernel]]

Соединиться с другим узлом:
#+BEGIN_SRC Erlang
net_kernel:connect_node/1
#+END_SRC

Дать имя своему узлу, настроить heart beat:
#+BEGIN_SRC Erlang
net_kernel:start([Name, shortnames])
net_kernel:start([Name, longnames, HeartBeat])
net_kernel:set_net_ticktime(5)
#+END_SRC

*rpc*
[[http://www.erlang.org/doc/man/rpc.html][Remote Procedure Call Services]]

Понятно, что этот модуль очень важный и полезный :)

Синхронный вызов функции на другом узле:
#+BEGIN_SRC Erlang
rpc:call(Node, Module, Function, Args)
rpc:call(Node, Module, Function, Args, Timeout)
#+END_SRC

Асинхронный вызов функции:
#+BEGIN_SRC Erlang
Res = rpc:asyn_call(node, module, function, arguments)
#+END_SRC
и отложенное получение результата, блокирующее:
#+BEGIN_SRC Erlang
rpc:yield(Res)
#+END_SRC
и не блокирующее:
#+BEGIN_SRC Erlang
rpc:nb_yield(Res, Timeout) (non blocking)
#+END_SRC

Синхронный вызов функции на всех, или на указанных узлах в кластере:
#+BEGIN_SRC Erlang
rpc:multicall(Module, Function, Args)
rpc:multicall(Nodes, Module, Function, Args)
rpc:multicall(Module, Function, Args, Timeout)
rpc:multicall(Nodes, Module, Function, Args, Timeout)
#+END_SRC

Асинхронный вызов функции, когда результат вообще не нужен:
#+BEGIN_SRC Erlang
rpc:cast(Node, Module, Function, Args)
#+END_SRC

Бродкаст сообщения зарегистрированному процессу на указанных узлах.
С подтверждением получения:
#+BEGIN_SRC Erlang
rpc:sbcast(Nodes, Name, Msg)
#+END_SRC

Без подтверждения получения:
#+BEGIN_SRC Erlang
rpc:abcast(Nodes, Name, Msg)
#+END_SRC


* Распределенное OTP приложение

Одно из удобных высокоуровневых средств, это распределенное OTP приложение.

Тема хорошо раскрыта у Фреда Хеберта в LYSE, в главе [[http://learnyousomeerlang.com/distributed-otp-applications][Distributed OTP Applications]].

Обычное OTP приложение имеет состояния: loaded, started, stopped, uploaded.
У распределенного еще добавляется состояние running.

В кластере загружаются и запускаются копии приложения на всех узлах. Но только одно из них
находится в состоянии running -- реально выполняется. Остальные не выполняются, ждут.
Если узел с running приложением падает, то начинает выполняться одно из приложений на другом узле.
Это механизм Failover -- резервный узел берет на себя функцию упавшего основного узла.

Затем, когда упавший узел восстанавливается, приложение на нем снова запускается, а резервное
переходит в режим ожидания. Это механизм Takeover.

Мониторинг состояния узлов, Failover и Takeover OTP берет на себя. Но это не значит,
что программисту ничего делать не нужно. Когда приложение падает, оно теряет свое состояние.
Как сохранить это состояние, как восстановить после падения, как передать из одного
приложения другому -- это все на совести программиста.


