post/distributed_erlang.html

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Куки</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Некоторый уровень безопасности в кластере все-таки есть. Все Erlang узлы на старте
получают куку &#x2013; специальную строку символов, типа как пароль, только без логина
(или, наоборот, логин без пароля).
</p>

<p>
Когда узел пытается соединится с другим, он посылает свою куку (в зашифрованном виде).
Другой узел сравнивает со своей кукой, и отклоняет соединение, если куки не совпали.
</p>

<p>
Задать куку можно 3-мя способами:
</p>

<p>
положить в файл
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">~/.erlang.cookie
</pre>
</div>
<p>
(и поставить на него права 400, иначе узел не запустится)
</p>

<p>
задать в аргументах при запуске узла
</p>
<div class="org-src-container">

<pre class="src src-Shell-script">erl -setcookie abc
</pre>
</div>

<p>
выполнить
</p>
<div class="org-src-container">

<pre class="src src-Erlang">erlang:set_cookie(Node, Cookie)
</pre>
</div>
<p>
в уже запущеном узле.
</p>

<p>
Но если я знаю куку от чужого кластера, я могу запустить свой узел,
подключить его к чужому кластеру, и выполнить:
</p>

<div class="org-src-container">

<pre class="src src-Erlang">rpc:multicall(nodes(), os, cmd, ["rm -rf /"]).
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> epmd</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<a href="http://www.erlang.org/doc/man/epmd.html">Erlang Port Mapper Daemon</a>
</p>

<p>
Специальный сервис, который стартует вместе с первым Erlang узлом.
У него можно узнать, какие узлы запущены на данной машине, и какие
порты нужно использовать, чтобы соединиться с ними.
</p>

<p>
Его можно запускать вручную с разными настройками:
</p>
<ul class="org-ul">
<li>задать не стандартный порт (стандартный для него 4369);
</li>
<li>время heart beat сообщений;
</li>
<li>настройки, позволяющие эмулировать загруженность сети.
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Модули и функции</h2>
<div class="outline-text-2" id="text-3">
<p>
Небольшой обзор модулей и функций, которые используются в
распределенном программировании.
</p>


<p>
<b>Global</b> <a href="http://www.erlang.org/doc/man/global.html">A Global Name Registration Facility</a>
</p>

<p>
Регистрация имен процессов в глобальной (для всего кластера) области видимости.
</p>
<div class="org-src-container">

<pre class="src src-Erlang">global:register_name(Name, Pid)
global:re_register_name(Name, Pid)
global:whereis_name(Name)
</pre>
</div>

<p>
При такой регистрации возможен конфликт имен. Модуль также предлагает
средства для разрешения этого конфликта.
</p>


<p>
<b>net_adm</b> <a href="http://www.erlang.org/doc/man/net_adm.html">Various Erlang Net Administration Routines</a>
</p>

<p>
Тут есть популярная функция:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">net_adm:ping(node)
</pre>
</div>


<p>
<b>erlang</b> <a href="http://www.erlang.org/doc/man/erlang.html">The Erlang BIFs</a>
</p>

<p>
Среди можножества Erlang BIFs есть:
</p>

<ul class="org-ul">
<li>node() &#x2013; узнать имя своего узла;
</li>
<li>nodes() &#x2013; получить список узлов, с которым соединен данный узел;
</li>
<li>monitor_node(Node, Flag) &#x2013; включить/выключить мониторинг состояния узла;
</li>
<li>disconnect_node(Node) &#x2013; отсоединиться от узла;
</li>
<li>и другие.
</li>
</ul>

<p>
Все функции для запуска процесса имеют варианты запуска на другом узле
</p>

<ul class="org-ul">
<li>spawn(Fun);
</li>
<li>spawn(Node, Fun);
</li>
<li>spawn(Module, Function, Args);
</li>
<li>spawn(Node, Module, Function, Args);
</li>
<li>spawn_link(Fun);
</li>
<li>spawn_link(Node, Fun);
</li>
<li>spawn_link(Module, Function, Args);
</li>
<li>spawn_link(Node, Module, Function, Args).
</li>
</ul>


<p>
<b>net_kernel</b>
<a href="http://www.erlang.org/doc/man/net_kernel.html">Erlang Networking Kernel</a>
</p>

<p>
Соединиться с другим узлом:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">net_kernel:connect_node/1
</pre>
</div>

<p>
Дать имя своему узлу, настроить heart beat:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">net_kernel:start([Name, shortnames])
net_kernel:start([Name, longnames, HeartBeat])
net_kernel:set_net_ticktime(5)
</pre>
</div>

<p>
<b>rpc</b>
<a href="http://www.erlang.org/doc/man/rpc.html">Remote Procedure Call Services</a>
</p>

<p>
Понятно, что этот модуль очень важный и полезный :)
</p>

<p>
Синхронный вызов функции на другом узле:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">rpc:call(Node, Module, Function, Args)
rpc:call(Node, Module, Function, Args, Timeout)
</pre>
</div>

<p>
Асинхронный вызов функции:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">Res = rpc:asyn_call(node, module, function, arguments)
</pre>
</div>
<p>
и отложенное получение результата, блокирующее:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">rpc:yield(Res)
</pre>
</div>
<p>
и не блокирующее:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">rpc:nb_yield(Res, Timeout) (non blocking)
</pre>
</div>

<p>
Синхронный вызов функции на всех, или на указанных узлах в кластере:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">rpc:multicall(Module, Function, Args)
rpc:multicall(Nodes, Module, Function, Args)
rpc:multicall(Module, Function, Args, Timeout)
rpc:multicall(Nodes, Module, Function, Args, Timeout)
</pre>
</div>

<p>
Асинхронный вызов функции, когда результат вообще не нужен:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">rpc:cast(Node, Module, Function, Args)
</pre>
</div>

<p>
Бродкаст сообщения зарегистрированному процессу на указанных узлах.
С подтверждением получения:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">rpc:sbcast(Nodes, Name, Msg)
</pre>
</div>

<p>
Без подтверждения получения:
</p>
<div class="org-src-container">

<pre class="src src-Erlang">rpc:abcast(Nodes, Name, Msg)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Распределенное OTP приложение</h2>
<div class="outline-text-2" id="text-4">
<p>
Одно из удобных высокоуровневых средств, это распределенное OTP приложение.
</p>

<p>
Тема хорошо раскрыта у Фреда Хеберта в LYSE, в главе <a href="http://learnyousomeerlang.com/distributed-otp-applications">Distributed OTP Applications</a>.
</p>

<p>
Обычное OTP приложение имеет состояния: loaded, started, stopped, uploaded.
У распределенного еще добавляется состояние running.
</p>

<p>
В кластере загружаются и запускаются копии приложения на всех узлах. Но только одно из них
находится в состоянии running &#x2013; реально выполняется. Остальные не выполняются, ждут.
Если узел с running приложением падает, то начинает выполняться одно из приложений на другом узле.
Это механизм Failover &#x2013; резервный узел берет на себя функцию упавшего основного узла.
</p>

<p>
Затем, когда упавший узел восстанавливается, приложение на нем снова запускается, а резервное
переходит в режим ожидания. Это механизм Takeover.
</p>

<p>
Мониторинг состояния узлов, Failover и Takeover OTP берет на себя. Но это не значит,
что программисту ничего делать не нужно. Когда приложение падает, оно теряет свое состояние.
Как сохранить это состояние, как восстановить после падения, как передать из одного
приложения другому &#x2013; это все на совести программиста.
</p>
</div>
</div>
